routes/web.php

SELECT * FROM `categories`
SELECT * FROM `posts` WHERE `posts`.`category_id` = 2 and `posts`.`category_id` IS not NULL
---
Route::get('posts/{post:slug}' ,[Postcontroller::class, 'show']);


Route::get('/categories',function(){
    return view('categories',[
        'title' => 'Post Categories',
        'categories' => Category::all()
    ]);
});



Route::get('/categories/{category:slug}', function(Category $category){
    return view('category',[
        'title' => $category->name,
        'posts' => $category->posts,
        'category' => $category->name
    ]);
});