app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `posts` ORDER BY `created_at` DESC
---
    public function index()
    {
        return view('posts',[
            "title" =>"All Post",
            "posts" => Post::with(['author','category'])->latest()->get()